[
    {
        "id": 1,
        "title": "Verdächtige E-Mail entdeckt",
        "description": "Ein Mitarbeiter meldet eine verdächtige E-Mail, die einen Anhang mit einem seltsamen Namen enthält.",
        "exercise_benefit": "Übt das Erkennen und Melden von Phishing-Versuchen.",
        "expected_response": "Die Teilnehmer sollten die E-Mail analysieren, den Anhang nicht öffnen und die IT-Sicherheitsabteilung informieren.",
        "communication_type": "email",
        "duration": 5,
        "nachrichtentext": "Hallo, \n\nich habe heute eine E-Mail bekommen, die durchaus vertrauenswürdig erscheint. Allerdings schickt mir dieser Absender sonst keine solchen Anhänge. Eventuell handelt es sich um eine Phishing Mail.\n\nBeste Gruesse\n\nKurt Lamensloh"
    },
    {
        "id": 2,
        "title": "Auffällig schnelle Kommunikation",
        "description": "Ein Mitarbeiter ruft an und meldet, dass die Kommunikation Über das interne Netzwerk ungewöhnlich langsam ist.",
        "exercise_benefit": "Übt die Identifikation von Netzwerkmanipulationen.",
        "expected_response": "Die Teilnehmer sollten die Netzwerklogs ÜberprÜfen, den Man-in-the-Middle-Angriff identifizieren und geeignete Gegenmaßnahmen ergreifen.",
        "communication_type": "text",
        "duration": 5,
        "nachrichtentext": "Sehr geehrter IT-Support,\n\nich möchte Ihnen mitteilen, dass ich seit heute Morgen eine ungewöhnlich langsame Netzwerkgeschwindigkeit in unserem internen Netzwerk bemerke. Diese Verzögerungen beeinträchtigen meine Arbeit erheblich, da sowohl das Abrufen von E-Mails als auch der Zugriff auf interne Server extrem langsam erfolgt.\n\nHier einige Details zur Problematik:\n\nDatum und Uhrzeit des Auftretens: Heute, seit ca. 09:00 Uhr\nBetroffene Anwendungen: E-Mail, internes CRM-System, Dokumentenmanagementsystem\nStandort: Büro Nr. 205, 2. Stock\nNetzwerkanbindung: Kabelgebunden\nIch habe bereits die üblichen Schritte zur Fehlerbehebung unternommen, wie das Neustarten meines Computers und das Überprüfen der Kabelverbindungen. Leider hat dies keine Verbesserung gebracht.\n\nIch bitte Sie daher dringend, diese Angelegenheit zu prüfen und zu beheben, da die aktuelle Situation die Arbeitsabläufe erheblich stört.\n\nVielen Dank im Voraus für Ihre schnelle Unterstützung.\n\nMit freundlichen Grüßen,\n\n[Ihr Name]\n[Ihre Position]\n[Abteilung]\n[Kontaktinformationen]"
    },
    {
        "id": 3,
        "title": "Verzögerte Kommunikation",
        "description": "Ein Mitarbeiter ruft an und meldet, dass die Kommunikation Über das interne Netzwerk ungewöhnlich langsam ist.",
        "exercise_benefit": "Übt die Identifikation von Netzwerkmanipulationen.",
        "expected_response": "Die Teilnehmer sollten die Netzwerklogs ÜberprÜfen, den Man-in-the-Middle-Angriff identifizieren und geeignete GegenmaÃŸnahmen ergreifen.",
        "communication_type": "email",
        "duration": 5,
        "nachrichtentext": "Hallo IT-Team,\n\nich wollte euch informieren, dass die Netzwerkgeschwindigkeit seit heute Morgen sehr langsam ist. Es dauert sehr lange, E-Mails zu laden und auf unsere internen Systeme zuzugreifen.\n\nIch bin mir nicht sicher, woran es liegt, aber es beeinträchtigt meine Arbeit. Könnt ihr das bitte überprüfen?\n\nVielen Dank für eure Hilfe.\n\nViele Grüße,\n\n[Ihr Name]\n[Abteilung]\n[Kontaktinformationen]"
    },
    {
        "id": 4,
        "title": "Datenbankfehler",
        "description": "Ein Datenbankadministrator meldet persönlich, dass ungewöhnliche SQL-Abfragen die Datenbank belasten.",
        "exercise_benefit": "Übt die Erkennung und Reaktion auf SQL-Injection-Angriffe.",
        "expected_response": "Die Teilnehmer sollten die Log-Dateien der Datenbank analysieren, die SQL-Injection-Angriffe identifizieren und die Schwachstellen schlieÃŸen.",
        "communication_type": "text",
        "duration": 10,
        "nachrichtentext": "Hallo IT-Team,\n\nich möchte euch darauf aufmerksam machen, dass ich in den letzten Stunden eine erhöhte Belastung unserer Datenbank durch ungewöhnliche SQL-Abfragen beobachtet habe. Diese Abfragen führen zu erheblichen Performance-Einbußen und beeinträchtigen die normale Funktionalität unserer Anwendungen.\n\nHier einige Details:\n\nZeitpunkt des Auftretens: Heute, ab ca. 10:30 Uhr\nArt der Abfragen: Komplexe JOINs und Sub-Queries, die ungewöhnlich viel Zeit und Ressourcen beanspruchen\nBetroffene Datenbank: [Name der Datenbank]\nAuswirkungen: Verlangsamung der Anwendungsleistung, gelegentliche Timeouts\nIch habe bereits einige der auffälligen Abfragen identifiziert und protokolliert. Es wäre hilfreich, wenn wir diese zeitnah analysieren und entsprechende Maßnahmen ergreifen könnten, um die Performance wiederherzustellen.\n\nBitte lasst mich wissen, wie wir am besten vorgehen sollen.\n\nVielen Dank für eure Unterstützung.\n\nBeste Grüße,\n\n[Ihr Name]\nDatenbankadministrator\n[Kontaktinformationen]"
    },
    {
        "id": 5,
        "title": "Malware-Alarm",
        "description": "Das Antivirenprogramm meldet einen Malware-Fund auf einem Mitarbeiter-PC.",
        "exercise_benefit": "Übt die Reaktion auf Malware-Infektionen.",
        "expected_response": "Die Teilnehmer sollten die Malware isolieren, das infizierte System bereinigen und die Quelle der Infektion identifizieren.",
        "communication_type": "email",
        "duration": 33,
        "nachrichtentext": "Hallo IT-Support-Team,\n\ndas Antivirenprogramm auf meinem PC hat gerade eine Malware-Infektion entdeckt. Die Warnung kam heute um [Zeit] und betrifft eine Datei, die ich nicht bewusst heruntergeladen habe.\n\nHier sind die Details:\n\nBetroffene Datei: [Dateiname und Pfad]\nZeitpunkt des Fundes: Heute, um [Zeit]\nName der Malware: [Malware-Name, falls bekannt]\nAktionen des Antivirenprogramms: [z.B. \"In Quarantäne verschoben\", \"Löschversuch fehlgeschlagen\" etc.]\nIch habe den PC derzeit vom Netzwerk getrennt, um eine mögliche Ausbreitung zu verhindern. Ich bitte um eine schnelle Überprüfung und Unterstützung bei der Bereinigung meines Systems.\n\nVielen Dank im Voraus.\n\nMit freundlichen Grüßen,\n\n[Ihr Name]\n[Abteilung]\n[Kontaktinformationen]"
    },
    {
        "id": 6,
        "title": "SicherheitslÜcke entdeckt",
        "description": "Ein Mitarbeiter erhält eine SMS mit der Information Über eine neu entdeckte SicherheitslÜcke, die ausgenutzt wird.",
        "exercise_benefit": "Übt die Reaktion auf Zero-Day-Angriffe.",
        "expected_response": "Die Teilnehmer sollten schnellstmöglich Patches anwenden oder Workarounds implementieren und das System Überwachen.",
        "communication_type": "email",
        "duration": 33,
        "nachrichtentext": "Hallo IT-Support-Team,\n\nich habe gerade eine SMS erhalten, die auf eine neu entdeckte Sicherheitslücke hinweist, die derzeit aktiv ausgenutzt wird. Die Nachricht enthält keine weiteren Details, aber es scheint ernst zu sein.\n\nHier ist der Text der SMS:\n\"[SMS-Inhalt einfügen]\"\n\nIch bin mir nicht sicher, welche Systeme betroffen sind oder welche Maßnahmen ich ergreifen soll. Könnt ihr bitte diese Angelegenheit umgehend prüfen und uns Anweisungen geben, wie wir weiter vorgehen sollen?\n\nVielen Dank für eure schnelle Unterstützung.\n\nViele Grüße,\n\n[Ihr Name]\n[Abteilung]\n[Kontaktinformationen]"
    },
    {
        "id": 7,
        "title": "Anomalie bei Anmeldeversuchen",
        "description": "Das Sicherheitssystem meldet eine hohe Anzahl fehlgeschlagener Anmeldeversuche.",
        "exercise_benefit": "Übt die Erkennung und Reaktion auf Brute-Force-Angriffe.",
        "expected_response": "Die Teilnehmer sollten die IP-Adressen blockieren, von denen die Angriffe ausgehen, und die betroffenen Konten Überwachen.",
        "communication_type": "text",
        "duration": 10,
        "nachrichtentext": "[SYSTEMMELDUNG]\n\nALERT: Eine hohe Anzahl fehlgeschlagener Anmeldeversuche wurde registriert.\n\nDetails:\n\nDatum/Zeit: 2024-06-04 14:35:27\nBetroffene Benutzerkonten: user123, user456, admin01\nAnzahl fehlgeschlagener Versuche: 150\nUrsprungs-IP-Adressen: 192.168.1.10, 192.168.1.15, 203.0.113.5\nLogauszug:\n\nyaml\nCode kopieren\n2024-06-04 14:30:12 - LOGIN FAILED - user123 - 192.168.1.10\n2024-06-04 14:30:25 - LOGIN FAILED - user456 - 192.168.1.15\n2024-06-04 14:30:35 - LOGIN FAILED - admin01 - 203.0.113.5\n2024-06-04 14:31:05 - LOGIN FAILED - user123 - 192.168.1.10\n2024-06-04 14:31:15 - LOGIN FAILED - user456 - 192.168.1.15\n...\nEmpfohlene Maßnahmen:\n\nÜberprüfen Sie die betroffenen Konten auf verdächtige Aktivitäten.\nSetzen Sie bei Bedarf Sicherheitsrichtlinien durch, wie z.B. Passwort-Resets.\nÜberwachen Sie weiterhin die Anmeldeversuche und passen Sie die Sicherheitsmaßnahmen entsprechend an.\nDiese Meldung wurde automatisch vom Sicherheitssystem generiert.\n\n[Sicherheitssystem]"
    },
    {
        "id": 8,
        "title": "Verdächtiger Anruf",
        "description": "Ein Mitarbeiter berichtet von einem verdächtigen Anruf, bei dem nach vertraulichen Informationen gefragt wurde.",
        "exercise_benefit": "Übt die Identifikation und Meldung von Social-Engineering-Versuchen.",
        "expected_response": "Die Teilnehmer sollten den Vorfall dokumentieren, die betroffenen Mitarbeiter informieren und SicherheitsmaÃŸnahmen verstärken.",
        "communication_type": "call",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 9,
        "title": "Ungewöhnlicher Netzwerkverkehr",
        "description": "Das SicherheitsÜberwachungssystem meldet ungewöhnlichen, verdächtigen Netzwerkverkehr.",
        "exercise_benefit": "Übt die Erkennung und Reaktion auf fortschrittliche Bedrohungen.",
        "expected_response": "Die Teilnehmer sollten den Netzwerkverkehr analysieren, die Bedrohung identifizieren und langfristige ÜberwachungsmaÃŸnahmen einleiten.",
        "communication_type": "email",
        "duration": 15,
        "nachrichtentext": "na"
    },
    {
        "id": 10,
        "title": "Verdächtige Webaktivität",
        "description": "Ein Webentwickler meldet ungewöhnliche JavaScript-Aktivitäten auf der Firmenwebseite.",
        "exercise_benefit": "Übt die Erkennung und Reaktion auf XSS-Angriffe.",
        "expected_response": "Die Teilnehmer sollten den Schadcode entfernen, die SicherheitslÜcke schlieÃŸen und die Webseite Überwachen.",
        "communication_type": "email",
        "duration": 5,
        "nachrichtentext": "na"
    },
    {
        "id": 11,
        "title": "Umleitung auf falsche Webseiten",
        "description": "Ein Mitarbeiter meldet, dass er auf eine falsche Webseite umgeleitet wurde, als er versuchte, auf die Firmenwebseite zuzugreifen.",
        "exercise_benefit": "Übt die Erkennung und Reaktion auf DNS-Spoofing-Angriffe.",
        "expected_response": "Die Teilnehmer sollten die DNS-Einstellungen ÜberprÜfen, die falschen Einträge entfernen und die betroffenen Systeme bereinigen.",
        "communication_type": "text",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 12,
        "title": "Verdächtiges Verhalten eines Mitarbeiters",
        "description": "Ein Mitarbeiter meldet persönlich verdächtiges Verhalten eines Kollegen, der unbefugt auf sensible Daten zugreift.",
        "exercise_benefit": "Übt die Erkennung und Reaktion auf Insider-Bedrohungen.",
        "expected_response": "Die Teilnehmer sollten den Vorfall untersuchen, die Zugriffsprotokolle ÜberprÜfen und geeignete MaÃŸnahmen gegen den Insider ergreifen.",
        "communication_type": "personally",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 13,
        "title": "Gezielte Phishing-E-Mail",
        "description": "Ein hochrangiger Mitarbeiter meldet den Erhalt einer gezielten Phishing-E-Mail, die sehr echt aussieht.",
        "exercise_benefit": "Übt die Erkennung und Reaktion auf gezielte Phishing-Angriffe.",
        "expected_response": "Die Teilnehmer sollten die E-Mail analysieren, den Anhang nicht öffnen und die IT-Sicherheitsabteilung informieren.",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 14,
        "title": "Massenhafte Anmeldeversuche",
        "description": "Das Sicherheitssystem meldet massenhafte Anmeldeversuche mit bekannten Anmeldedaten.",
        "exercise_benefit": "Übt die Erkennung und Reaktion auf Credential-Stuffing-Angriffe.",
        "expected_response": "Die Teilnehmer sollten die betroffenen Konten sperren, die IP-Adressen blockieren und die Benutzer zur Passwortänderung auffordern.",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 15,
        "title": "Lieferant meldet Sicherheitsvorfall",
        "description": "Ein Lieferant ruft an und meldet einen Sicherheitsvorfall, der möglicherweise die Lieferkette betrifft.",
        "exercise_benefit": "Übt die Reaktion auf Angriffe auf die Lieferkette.",
        "expected_response": "Die Teilnehmer sollten den Vorfall untersuchen, die betroffenen Systeme isolieren und den Lieferanten unterstÜtzen.",
        "communication_type": "call",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 16,
        "title": "Unbefugte Berechtigungserhöhung",
        "description": "Das System meldet eine unbefugte Berechtigungserhöhung  eines Benutzerkontos.",
        "exercise_benefit": "Übt die Erkennung und Reaktion auf Privilege-Escalation-Angriffe.",
        "expected_response": "Die Teilnehmer sollten das Konto sperren, die Protokolle ÜberprÜfen und die Schwachstelle beheben.",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 17,
        "title": "Hijacking einer Benutzersitzung",
        "description": "Ein Benutzer meldet, dass seine Sitzung beendet wurde und er nicht mehr auf das System zugreifen kann.",
        "exercise_benefit": "Übt die Erkennung und Reaktion auf Session-Hijacking-Angriffe.",
        "expected_response": "Die Teilnehmer sollten die Sitzungsprotokolle ÜberprÜfen, die Sitzung zurÜcksetzen und die Sicherheitsvorkehrungen verstärken.",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 18,
        "title": "Initial Phishing Email",
        "description": "Versenden einer gefälschten E-Mail von einem angeblich bekannten Dienstleister, der die Empfänger auffordert, auf einen Link zu klicken, um ihre Kontoinformationen zu aktualisieren.",
        "exercise_benefit": "ÜberprÜfung des Bewusstseins und der Vorsicht der Mitarbeiter gegenÜber Phishing-Angriffen.",
        "expected_response": "Die Teilnehmer sollten die E-Mail analysieren, den Link nicht anklicken und die IT-Sicherheitsabteilung informieren.",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 19,
        "title": "Fake Login Page",
        "description": "Erstellen einer gefälschten Anmeldeseite, die identisch mit der legitimen Unternehmensseite aussieht, um Anmeldedaten zu sammeln.",
        "exercise_benefit": "Test der Fähigkeit zur Erkennung von gefälschten Webseiten.",
        "expected_response": "Die Teilnehmer sollten die Seite nicht nutzen, die IT-Sicherheitsabteilung informieren und die Seite melden.",
        "communication_type": "web",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 20,
        "title": "Follow-up Email",
        "description": "Versenden einer Follow-up E-Mail an Mitarbeiter, die den initialen Phishing-Link nicht angeklickt haben, um sie erneut zur Handlung aufzufordern.",
        "exercise_benefit": "ÜberprÜfung des erneuten Versuchs zur Täuschung von Mitarbeitern.",
        "expected_response": "Die Teilnehmer sollten die E-Mail ignorieren und die IT-Sicherheitsabteilung informieren.",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 21,
        "title": "Spear Phishing Email",
        "description": "Versenden einer personalisierten Phishing-E-Mail an einen spezifischen Mitarbeiter mit Informationen, die aus sozialen Medien oder anderen Quellen gesammelt wurden.",
        "exercise_benefit": "Test der Wachsamkeit von Mitarbeitern gegenÜber personalisierten Phishing-Versuchen.",
        "expected_response": "Die Teilnehmer sollten die E-Mail analysieren, den Link nicht anklicken und die IT-Sicherheitsabteilung informieren.",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 22,
        "title": "Executive Phishing",
        "description": "Versenden einer gefälschten E-Mail im Namen eines hochrangigen Managers oder GeschäftsfÜhrers, die eine dringende Aktion erfordert.",
        "exercise_benefit": "Test der Bereitschaft der Mitarbeiter, Autoritäten zu hinterfragen und Informationen zu schÜtzen.",
        "expected_response": "Die Teilnehmer sollten die E-Mail ignorieren und die IT-Sicherheitsabteilung informieren.",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 23,
        "title": "Credential Harvesting",
        "description": "Versenden einer E-Mail mit einem Link zu einer Seite, die vorgibt, ein IT-Support-Portal zu sein, um Anmeldedaten zu sammeln.",
        "exercise_benefit": "Test der Fähigkeit zur Erkennung und Vermeidung von Credential-Harvesting-Versuchen.",
        "expected_response": "Die Teilnehmer sollten die Seite nicht nutzen, die IT-Sicherheitsabteilung informieren und die Seite melden.",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 24,
        "title": "Training Reminder",
        "description": "Versenden einer E-Mail, die vorgibt, eine Erinnerung an eine verpflichtende Sicherheitschulung zu sein, mit einem Link zu einer gefälschten Anmeldeseite.",
        "exercise_benefit": "Test der Wachsamkeit gegenÜber gefälschten Schulungserinnerungen.",
        "expected_response": "Die Teilnehmer sollten die E-Mail ignorieren und die IT-Sicherheitsabteilung informieren.",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 25,
        "title": "Fake Invoice",
        "description": "Versenden einer E-Mail mit einem Anhang, der vorgibt, eine Rechnung zu sein, die geöffnet werden muss.",
        "exercise_benefit": "Test der Vorsicht im Umgang mit Anhängen von unbekannten Quellen.",
        "expected_response": "Die Teilnehmer sollten den Anhang nicht öffnen und die IT-Sicherheitsabteilung informieren.",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 26,
        "title": "Contest Winner Notification",
        "description": "Versenden einer E-Mail, die vorgibt, dass der Empfänger einen Preis gewonnen hat und persönliche Informationen zur Bestätigung benötigt.",
        "exercise_benefit": "Test der Wachsamkeit gegenÜber gefälschten Gewinnbenachrichtigungen.",
        "expected_response": "Die Teilnehmer sollten die E-Mail ignorieren und die IT-Sicherheitsabteilung informieren.",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 27,
        "title": "Fake Survey",
        "description": "Versenden einer E-Mail mit einem Link zu einer gefälschten Umfrage, die angeblich von der Unternehmensleitung stammt, um Mitarbeiter zur Teilnahme zu bewegen.",
        "exercise_benefit": "Test der Vorsicht gegenüber gefälschten Umfragen.",
        "expected_response": "Die Teilnehmer sollten die Umfrage ignorieren und die IT-Sicherheitsabteilung informieren.",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    },
    {
        "id": 28,
        "title": "Break",
        "description": "Break.",
        "exercise_benefit": "Lunch.",
        "expected_response": "Do not talk about work.",
        "communication_type": "email",
        "duration": 120,
        "nachrichtentext": "na"
    },
    {
        "id": 29,
        "title": "The End",
        "description": "Stop everything.",
        "exercise_benefit": "Sleeping?",
        "expected_response": "na",
        "communication_type": "email",
        "duration": 10,
        "nachrichtentext": "na"
    }
]